README.md
+++
title = "Emacs Configuration"
author = ["Kazure Zheng"]
draft = false
+++

From now on my Emacs configuration will be stable and reliable.
However, there is still a long way to go.


## Road Map {#road-map}

1.  Write the document and reorganize my configuration.
2.  Continuing tweaking my configuration.
    -   [Centaur Emacs](https://github.com/seagle0128/.emacs.d)
    -   [jwiegley](https://github.com/jwiegley/dot-emacs/tree/master): the author of **use-package**
    -   [karthink](https://github.com/karthink/.emacs.d): the author of **gptel**


## Todo List {#todo-list}

-   [ ] magit forge
-   [ ] customize theme
-   [ ] save tab-bar
-   [ ] aggressive-indent
-   [ ] present in Emacs
-   [ ] easy-nav in read-only mode


## Acknowlegements {#acknowlegements}

Special thanks to

-   [ManateeLazyCat](https://github.com/manateelazycat): author of **lsp-bridge**
-   [Emacs China](https://emacs-china.org/)
-   [David Wilson](https://codeberg.org/daviwil)
-   [Jonas Bernoulli](https://github.com/tarsius): author of **borg**
-   ... to be continue

for their valuable inspiration and contribution to the Emacs community.
